Today we will be exploring **The Titanic dataset** which is commonly used in introductory Machine Learning classes.
It contains data for 887 passengers on the Titanic. Each row represents one person. The columns describe different attributes about the person including whether they survived, their age, their on-board class, their sex, and the fare they paid.
This dataset is already included to seaborn package

In [34]:
import seaborn as sns
sns.set_theme()
titanic = sns.load_dataset('titanic');
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# For the three tasks below try to use as many vizualization as possible

## Plot the distribution of passengers age and fare

## Check how these distributions vary depending on gender of passengers

## Check how these distributions vary depending on the class variable

# Visually explore the dataset and try to find what variables are closely related to survival chance. What criteria might be used to classify passengers as alive or not?